{
  "trends": [
    {
      "name": "JK Rowling",
      "url": "http://twitter.com/search?q=%22JK+Rowling%22",
      "promoted_content": null,
      "query": "%22JK+Rowling%22",
      "tweet_volume": 380645,
      "tweets": [
        "Hey. Just in case you weren't clued in:\n\nJK Rowling uses her gigantic platform to spout transphobic garbage.\n\nI don… ",
        "jk rowling’s patronus is magaret thatcher",
        "Was this a waste of 5 hours?? Let me know 😅 Also can’t believe @jk_rowling retweeted this video 🤪🤪🤪 Thank you guys… ",
        "@andrevanwanrooy @jk_rowling well the world being heteronormative is a bad thing so saying things are like this bec… ",
        "@LiJanessa @JenJenIsland @CorruptionSick @KirkeVincent @jk_rowling Accept in what way?",
        "@max_jpeg_ @callmeovr @jk_rowling Well, I thought you were an ordinary man, because you take all the words solely o… ",
        "@jk_rowling I’m a woman. I’m pansexual. And you are a TERF. That’s not woman hating. YOU are women hating.",
        "@JAHayes @MalconHeavy @Aleen @jk_rowling Biologically female, yes.",
        "And in 2020 we found out that JK Rowling was Voldemort all along",
        "@jk_rowling please shut the fuck up",
        "@TwisterFilm @benjaminokeefe @jk_rowling This is the room of adults. You seem lost.",
        "@Aleen @jk_rowling Women are not defined by how much they flood their bodies with estrogen while still having dicks, either.",
        "@dankyankees @CiaranStrange @DebbieHayton @MaraWilson @jk_rowling You brought it up like it was relevant. If you no… ",
        "@TheValkyrie14 @angryqueerhag @MrsNeverwhere @knifevacation1 @FionneOrlander @sydneydito @jk_rowling your pinned tw… ",
        "@the_debijackson @jk_rowling She is a girl she is male. females are female."
      ]
    },
    {
      "name": "#UFC250",
      "url": "http://twitter.com/search?q=%23UFC250",
      "promoted_content": null,
      "query": "%23UFC250",
      "tweet_volume": 49624,
      "tweets": [
        "RIP to the Classic UFC Championship Belt - 2001 to 2020. Whatever the outcome tonight, it's the last time you'll se… ",
        "UFC light heavyweight Devin Clark took a knee and raised his fist during his intro at #UFC250 ",
        "FOR THE BELT! 🏆\n\n🦁 The queen of the jungle returns to face a challenger from up north!\n\nGet the #UFC250 ESPN+ ➡️… ",
        "the IQ of this Alex Caceres..!?!? following Hooper to the ground.. just smh #UFC250",
        "Who matched this poor kid 😭 #UFC250",
        "Chase really needs to improve on his striking, he's got plenty of time to though #UFC250",
        "20-18 at best #UFC250",
        "Alex Caceres is fucking him up. #UFC250",
        "#UFC250 Current LIVE Betting Odds After Round 2\n\nAlex Caceres -600\nChase Hooper +400",
        "This fight is crazy. #UFC250",
        "It's 20-17 Caceres, but he's playing with fire on the mat. #UFC250",
        "\"ya just don't want to see a 20 year old kid getting hit this much.\"\n-Joe Rogan.\n#UFC250",
        "I aint see my boy Bruce Leroy fight in a min #UFC250",
        "Back in the best place to watch #UFC250 ",
        "Chase just eating shots but he’s still in it! #UFC250"
      ]
    },
    {
      "name": "TERF",
      "url": "http://twitter.com/search?q=TERF",
      "promoted_content": null,
      "query": "TERF",
      "tweet_volume": 65727,
      "tweets": [
        "I can’t believe that in this moment @jk_rowling has decided the most useful thing to tweet to her 14.5 million foll… ",
        "i for one do NOT think it’s fair that the british government mails all their citizens a pill that they must take on… ",
        "I’m almost never on twitter and didn’t realize I was still following JK Rowing. Unfollowed her because she is an un… ",
        "@gabundy TERF is a misogynistic term of abuse.\nreported",
        "She’s seriously gonna double down on the TERF war? And throwing down the “I have trans friends” argument? ",
        "@jk_rowling I’m a woman. I’m pansexual. And you are a TERF. That’s not woman hating. YOU are women hating.",
        "@jk_rowling then why arent you marching? it's 'cuz you're a terf.",
        "@andrzejam @YOONKICAFE @lord_helpme57 @serenajazmine @jk_rowling by the way, you don’t mean ‘what I have seen from… ",
        "@EMASH9292 Just because your TERF of a creator says something, but doesn't put it in the text of her book, is meaningless.",
        "Being a terf piece of shit is a bigger red flag. ",
        "you ruined every last shred of respect I had for you, fucking terf ",
        "@teganandsara TERF?",
        "@jk_rowling TERF",
        "@jk_rowling You just have to stick your stupid fucking face in everything, don't you? SHUT THE FUCK UP, you billion… ",
        "@deddieinsidee @____amyjane @toby_heck What’s terf mean?"
      ]
    },
    {
      "name": "#PublishingPaidMe",
      "url": "http://twitter.com/search?q=%23PublishingPaidMe",
      "promoted_content": null,
      "query": "%23PublishingPaidMe",
      "tweet_volume": 16371,
      "tweets": [
        "It’s pretty well known but $12,500 for An Untamed State, $15,000 for Bad Feminist, $100k for Hunger, $150k for Year… ",
        "Come on, white authors. Use the hashtag #PublishingPaidMe and share what you got for your books. Debuts as well. Le… ",
        "Important to watch the #PublishingPaidMe hash, writers and esp BIPOC writers. For the curious, as I recall, my adva… ",
        "I’ll spill a little for #PublishingPaidMe ... ",
        "#PublishingPaidMe Prison Island was a 2k advance, plus another $750 for the cover design (broken up that way so it… ",
        "#PublishingPaidMe :\n12.5k for Everything Is Beautiful, And I’m Not Afraid, a debut comic collection, full color 128… ",
        "#PublishingPaidMe is making my blood boil. #RepresentationMatters",
        "Was feeling pretty good today, and then I saw #PublishingPaidMe... ",
        "A thing I keep seeing on #publishingpaidme is this trend of white people apologizing and then folks replying with,… ",
        "@allieiswriting First and only traditionally published romance: No advance from house, 20% royalty rate #PublishingPaidMe",
        "#publishingpaidme - I once had a film rights offer and they offered $200. TWO. HUNDRED. DOLLARS. for a year long fi… ",
        "#PublishingPaidMe $100k for 3 books in an urban fantasy series after it went to auction in 2008 (3 times what the o… ",
        "#PublishingPaidMe nothing. Well, I did earn $500 in royalties from my first book. My 2nd came out during the pandem… ",
        "1st book: $2,500 + royalties\n2nd book: $4,500 + royalties\n\n(both novelty post card books, 31 pages written and illu… ",
        "#publishingpaidme so far is showing me I should be writing YA instead of illustrating picture books."
      ]
    },
    {
      "name": "#MatchAMillion",
      "url": "http://twitter.com/search?q=%23MatchAMillion",
      "promoted_content": null,
      "query": "%23MatchAMillion",
      "tweet_volume": 18764,
      "tweets": [
        "i just love the bts fandom so much. it's currently self-organizing through #matchamillion to match the group's $1 m… ",
        "I’ve donated. Have you, ARMY? #MatchAMillion @BTS_twt  💜",
        "If you cannot afford to donate right now, there are alternatives. Let’s all work together in our different ways to… ",
        "We’re definitely matching a million today. Love to see it ☺️ I’m so proud. #MatchAMillion ",
        "@ThaoDinh19 Thank you\n💜💜💜💜💜💜💜\n#MatchAMillion",
        "Thinking about how bts always have this positive impact on armys and always inspired us to do great things, as thei… ",
        "@OneInAnARMY Here’s mine 💜 #MatchAMillion ",
        "@OneInAnARMY All we need is for 1M ARMYs to donate $1 and we’ll reach our goal. Completely attainable and then some… ",
        "We can do it AMI! #MatchAMillion  https://t.co/Ax570zKCcW",
        "Am I the only one who thinks that the #MatchaMillion thingy is silly? Remember just last week y'all be preaching th… ",
        "omg #MatchAMillion is trending 🥺 imagine how amazing it'd be if we did",
        "Let's always support this movement and make our Black Armys and our Boys proud. @BTS_twt #MatchAMillion #BTSxARMY… ",
        "hi guys! if you have a few dollars to spare, please tap \"split donation\" to donate!!! #MatchAMillion ",
        "Let’s go ARMYs! 💜 \n\n#MatchAMillion ",
        "This makes me so proud 💜💜💜 #matchamillion\n"
      ]
    }
  ],
  "as_of": "2020-06-07T01:47:59Z",
  "created_at": "2020-06-07T01:41:26Z",
  "locations": [
    {
      "name": "United States",
      "woeid": 23424977
    }
  ]
}