{
  "name": "#FoxNewsisRacist",
  "url": "http://twitter.com/search?q=%23FoxNewsisRacist",
  "promoted_content": null,
  "query": "%23FoxNewsisRacist",
  "tweet_volume": 47724,
  "tweets": [
    "This tweet lists every time Sean Hannity ever pushed back against any of his many, many, many guests who were booke… ",
    "We looked at Fox News advertisers in recent weeks.\n\nMany of them have claimed to support Black Lives Matter on soci… ",
    "#FoxNewsisRacist is trending after doing a PowerPoint presentation on how the stock market sky rockets after killin… ",
    "@mmpadellan #FoxNewsisRacist top 2020 advertiser includes: @LibertyMutual Liberty, @SandalsResorts, @sleepnumber,… ",
    "Fox News&gt;&gt;\n\nNutrisystem, the network's top 2020 advertiser, Liberty Mutual Insurance, Nugenix, Sandals Resorts, Sle… ",
    "They been racist ! Things are just now coming to light 💡#FoxNewsisRacist",
    "Black Twitter seeing  #FoxNewsisRacist trending: ",
    "@seanhannity Again with this?  She’s participating in a movement while you are having a movement.🤡. I hope your wif… ",
    "Look 👀guys  @FoxNews must have seen the #FoxNewsisRacist tag and they’re doing their best\nto COUNTER  it with today… ",
    "Liberals who think it's ok to kill babies with abortion are just as bad as those who thought it was ok to have blac… ",
    "All these trump supporters popping up on #FoxNewsisRacist trying to defend #FoxNews 🤣🤣 \n\nNobody is arguing with you… ",
    "Are Laura Ingraham and Tucker Carlson still on the air? Then FOX News does not take this seriously. #FoxNewsisRacist ",
    "@Verizon please stop advertising on Faux News. #FoxNewsisRacist",
    "I mean there is a high chance of you are a republican that you’re racist... unless you’re just severely misinformed... #FoxNewsisRacist",
    "#FoxNewsisRacist is trending and I just have to laugh because my Japanese-American grandfather just tried to argue… ",
    "so we gon act like we didnt know.....\n#FoxNewsisRacist ",
    "wbk they're racist, at least y'all finally noticed #FoxNewsisRacist",
    "we been knew that\n#FoxNewsisRacist \n",
    "Fox News comparing these tragic events to stock market performance is beyond disbelief!   #FoxNewsisRacist… ",
    "If you quote Fox News when we have political discussions, your argument is invalid  #FoxNewsisRacist #FakeNews",
    "If you just realized that #FoxNewsisRacist, wait till I tell you how they've systematically propagated ignorance, h… ",
    "#WhenBidenTakesOver- the American hating morons who believe that #FoxNewsisRacist because Tucker Carlson criticized… ",
    "Exposed by protests is a shameful America where many black people endure bleak lives of survival because of the sys… ",
    "All this over #FoxNewsIsRacist LMAO "
  ]
}