{
  "name": "Joseph Campbell",
  "url": "http://twitter.com/search?q=%22Joseph+Campbell%22",
  "promoted_content": null,
  "query": "%22Joseph+Campbell%22",
  "tweet_volume": null,
  "tweets": [
    "I don't believe people are looking for the meaning of life as much as they are looking for the experience of being alive. - Joseph Campbell",
    "@thehill @IvankaTrump We all play the hero and the villain and all other roles through perception/different peoples… ",
    "@thehill @IvankaTrump \n\nDespite what Joseph Campbell believed or acted on in that regard, hi… https://t.co/mmtjbSsEGu",
    "@BenjaminPDixon Seriously quoting joseph campbell?!?!",
    "@IvankaTrump Given that you're using Joseph Campbell's words to back your assertions...\n\nIt might be helpful to rev… ",
    "Joseph Campbell is raging in his grave ",
    "You are complicit in an assault on peaceful protesters @IvankaTrump so please choke on your Joseph Campbell books. ",
    "@thehill Tone deaf Barbie in door knocker jewels &amp; 80s full pancake touting Joseph Campbell as country burns &amp; live… ",
    "@thehill Given that Ivanka is using Joseph Campbell's words to back her beliefs...\n\nIt might be helpful to revisit… ",
    "@JustinLawGuy Why is she quoting Joseph Campbell? His book wasn't about what an actual hero was. It was a critique… ",
    "@goldengateblond @RadioFreeTom “Wars and temper tantrums are the makeshifts of ignorance; regrets are illuminations… ",
    "@thekjohnston All you need to know about Ivanka Trump can be ascertained from that what she points out about Joseph… ",
    "@TheAuthorGuy @waltshaub I think this was after a tragic vagina steaming accident. Also pretty sure Joseph Campbell… ",
    "You, quoting Joseph Campbell doesn'y make any sense. Painful to watch. ",
    "you didn't even say anything about Black people\nnot once\nalso how dare you say anything about Joseph Campbell or St… ",
    "@Amy_Siskind Way to sound inspiring while saying absolutely nothing except that somehow she’s had struggles and Jos… ",
    "@thehill Right now your personal growth means nothing. Daddy is pure evil and must be desperate to put you out here… ",
    "@cmkinmia @thehill Well at least she reminded me why I despise Joseph Campbell. #VoteBlueToSaveAmerica2020",
    "Joseph Campbell and The Power of Myth with Bill Moyers ",
    "She did recently get her father to pickup The Bible in a time of hardship.  \n\nHer quote of Joseph Campbell, however… ",
    "@thehill I’m seriously starting to think she makes these tone deaf videos just to piss ppl off. It’s like “Sweetie,… ",
    "“The cave you fear to enter, holds the treasure you seek”\n- Joseph Campbell",
    "@CaslerNoel @IvankaTrump Hell no-- we're not letting the Trumps appropriate Joseph Campbell. @jcf_org",
    "If today if the first time you’re hearing of Joseph Campbell’s hero’s journey concept (I’m not sharing the video) y… "
  ]
}