{
  "name": "#BlackLivesMattters",
  "url": "http://twitter.com/search?q=%23BlackLivesMattters",
  "promoted_content": null,
  "query": "%23BlackLivesMattters",
  "tweet_volume": 174822,
  "tweets": [
    "Providence police held a black fire fighter at gunpoint in \"full fire department uniform\" in front of the fire depa… ",
    "Berlin right now: Tens of thousands join protest against racism.  #BlackLivesMattters",
    "Retweet if you’re a mother.\n\n#BlackLivesMattters ",
    "I fully back anyone’s right to protest and I do believe in the #BlackLivesMattters movement, but considering BAME p… ",
    "Asian Americans got the wrong assessment about who the United States biggest challenge is.  It's not Donald Trump.… ",
    "O ye who believe! be steadfast in the cause of Allah, bearing witness in equity; and let not a people’s enmity inci… ",
    "#BlackLivesMattters\n\nAll the protests that ever happened came to an end... And things slowly returned to before.\n\nI… ",
    "This system is set up for us to #Fail #Broken #BlackLivesMattters 💯",
    "Black Lives Matter is a MOVEMENT NOT A MOMENT.  \n#BlackLivesMattters ✊🏽✊🏽✊🏽",
    "#BlackLivesMattters they fucked up you’ve got Christians and witches on your side. Ya’ll are invincible now. ",
    "This is going to get ugly.\nThis is not #PeacefulProtests the is an insurrection by totalitarian communist eugenicis… ",
    "#BlackLivesMattters  unless they are are from Africa right? You don't see these black Americans and black  British… ",
    "We cannot forget about the sisters who are killed by police!!! #BlackLivesMattters",
    "Day 1: Bollywood supporting #BlackLivesMattters, speaking against racism and promoting equality. \nDay 2: promoting… ",
    "Stop Sweet Talking #BlackLivesMattters #CuckerTarlson ",
    "@NYGovCuomo \n\nCOMPLICITY, #VIOLATION of my Civil Rights; #COVERup; DISMISSED; FACILITATION in the commission of CRI… ",
    "Amazing scenes in Watford today showing solidarity with the #BlackLivesMattters movement. We are protesting accross… ",
    "If you’re already posting about your life and posting selfies, there’s a 100% chance I’m unfollowing you. There’s a… ",
    "#BlackLivesMattters and #DDay is trending, 2 totally different eras , But still the same racial Tension. It’s sad t… ",
    "Blueface Drops $36k On A Dining Room Table Set! Money bag | SEE VIDEO HERE&gt;  | #Blueface… https://t.co/4f3JQTkQEl",
    "#BlackLivesMattters One World Government is happening Thx America, UK, AU, France, Spain! ",
    "Ironic how everyone says black lives matter yet everyone is crowding the streets, aren't BAME people the most at ri… ",
    "The presence and pressure we’ve demonstrated in this movement is great but if we aren’t consistent week in and week… ",
    "People I know won't break the chain .\n#BlackLivesMattters \n\n    @SM_kmh_ @Taniakanij88 "
  ]
}