{
  "name": "Discomfort",
  "url": "http://twitter.com/search?q=Discomfort",
  "promoted_content": null,
  "query": "Discomfort",
  "tweet_volume": 12299,
  "tweets": [
    "“Times of discomfort”?\n\nGirl, please. People are getting killed. People were tear-gassed and violently removed so y… ",
    "Ivanka Trump: \"I've found that my greatest personal growth has arisen from times of discomfort and uncertainty.\" ",
    "“If it makes you uncomfortable, use the discomfort to create great change.”\n\nSpecial thanks to Tunde Oyeneyin:… ",
    "@kazweida @AhmedBaba_ Discomfort... Oh there is a pea in my cushion causing me discomfort... Can someone please get me a new one...",
    "@ananavarro The uncertainty part I can almost buy, but discomfort?  No way.",
    "The best part of any trip to the VA is the blood draw lab. It is staffed with the nicest, loveliest, most skilled b… ",
    "@thehill @IvankaTrump 's discomfort and uncertainty time photo shoots, funding provided by #TrumpFamilyGrifters: \nc… ",
    "\"Times of discomfort\"?!\nWoman never wanting for anything her entire life.\nWill someone shut her up, please?! ",
    "@thekjohnston Discomfort??? Make a speech the next time you’re strangled or gassed or shot with rubber bullets. Unt… ",
    "@thehill I find it interesting,  that she has arisen  from times of discomfort...sounds like a bunch of malarkey.",
    "@MollyJongFast The only discomfort she's ever felt was recovering from one of her MANY plastic surgery. Am I right… ",
    "@Zulutron @BoycottHegemony Sure enough!\n\nBut Putin ain't a naive either, he is an old hand, after all. He might dou… ",
    "Discomfort lol. She feels like she’s faced adversity because of that one time her team of au pairs got her sugarles… ",
    "@thehill Ask her to describe her \"discomfort \". Screw her~",
    "@thehill I'm not even going to waste time listening to this tone deaf bimbo bullshit Americans about her times of \"… ",
    "@JoJoFromJerz @thehill Maybe she experienced #discomfort when she visited her sweat shops! @WhiteHouse @POTUS @IvankaTrump",
    "@thehill \"times of discomfort and uncertainty\"?\nIs she talking about the time of been with Donald and Epstein on his Island?",
    "@Sundae_Gurl OMG @IvankaTrump , I bet your times of discomfort and uncertainty must be things NONE OF US peasants o… ",
    "@thehill This is my father who’s personal growth involved killing Nazi’s. Please tell us about discomfort and uncer… ",
    "@thehill What exactly does she consider \"discomfort and uncertainty?\" How she was going to pay her mortgage? Does s… ",
    "@thehill Discomfort &amp; uncertainty that daddy may lose in November. I can buy that but I doubt she has ever felt any… ",
    "@thehill And just what discomfort has she had???",
    "@MollyJongFast @thehill Times of discomfort and uncertainty are coming tho.... ",
    "The narrow minds of people is highly disturbing.\n\nIf people are NOT changing and growing in times of uncertainty an… "
  ]
}