{
  "name": "#WhenBidenTakesOver",
  "url": "http://twitter.com/search?q=%23WhenBidenTakesOver",
  "promoted_content": null,
  "query": "%23WhenBidenTakesOver",
  "tweet_volume": null,
  "tweets": [
    "#WhenBidenTakesOver I’m sure we won’t get bible photo ops at the expense of peaceful protesters.",
    "#WhenBidenTakesOver he will disband all police departments in the US and we will be able to live in peace in harmony once and for all!",
    "#WhenBidenTakesOver\n\nWhat will he do to recognize the sacrifice of @SenSanders?",
    "#WhenBidenTakesOver the country will fully fall apart. 13% unemployment will look like a party. Stock markets over… ",
    "#WhenBidenTakesOver Trump will have all the time he wants to play golf.⛳️",
    "#WhenBidenTakesOver Trump will lose \"millions and millions\" of dollars, \n\nBUT...\n#TRUMP WILL SHINE!!!… ",
    "#WhenBidenTakesOver mostly we'll just roll back to where we were in 2016, but that's still better than where we are… ",
    "When you are starving even the crumbs look good\n\nbut\n\nyou'll still starve to death.\n\n#WhenBidenTakesOver",
    "#WhenBidenTakesOver THIS BULLSHIT Will STOP... ",
    "#WhenBidenTakesOver- the American hating morons who believe that #FoxNewsisRacist because Tucker Carlson criticized… ",
    "But The Timing Tho'  🍿🍻\n\n#҉E҉x҉p҉o҉s҉e҉A҉N҉T҉I҉F҉A҉     #ATTACKANDDETHRONEGOD #TRUMP2020 #BarronTrump… ",
    "@Timcast #WhenBidenTakesOver - #VoteTrumpOut Two sides of the same coin. #WeThePeople will not be silenced.… ",
    "#WhenBidenTakesOver the US &amp; world will have officially gone to shit",
    "We will still be Fucked!!! \n\nRigged much? #WhenBidenTakesOver",
    "#WhenBidenTakesOver Everything will remain the same, but it will look a little more professional",
    "I just found the original members of #antifa planning an attack...Get ‘em, @realDonaldTrump! #DDay… ",
    "#WhenBidenTakesOver we only have 4 more years until @MichelleObama takes over.",
    "Why do liberals act like the Doomsday scenarios we talk about regarding Biden is just theory? \n\nBiden has a 40 year… ",
    "#WhenBidenTakesOver LOL.....this trending is so worth the memes. I mean .@JoeBiden can't even take over his own bra… ",
    "What will the left whine about then? You guys need Trump in office to have something to bitch about. Throw on your… ",
    "#WhenBidenTakesOver Are words you will never hear after November 3rd.",
    "WHO TOLD FOUX NEWS ABOUT THE PLAN TO ATTACK AND DETHRONE GOD? WAS IT YOU STEVE?? FUCK YOU STEVE!!\n\nCheck out our ne… ",
    "#WhenBidenTakesOver he'll protect  pedophiles worldwide. #CreepyJoe \n#SaveTheChildren #Pedowood \n\nWhere is #GhislaineMaxwell ?",
    "#WhenBidenTakesOver he will arrest the war criminal Barron Trump, criminalize gun ownership, and execute #BikersForTrump. #JoeBiden2020"
  ]
}