{
  "name": "Operation Overlord",
  "url": "http://twitter.com/search?q=%22Operation+Overlord%22",
  "promoted_content": null,
  "query": "%22Operation+Overlord%22",
  "tweet_volume": 11372,
  "tweets": [
    "On June 6, 1944, Allied Forces launched a combined assault on Nazi-occupied France. More than 150K American, Britis… ",
    "June 6, 1944. D-Day.\n\nAs part of Operation Overlord, 14,000 Canadian soldiers stormed Juno Beach. The Royal Canadia… ",
    "On June 6, 1944 the Allies conducted the largest seaborne invasion in history. Operation Overlord (D-Day invasion)… ",
    "Operation Overlord - and the stopped the fascists from using the road! ",
    "In honor of the 76th anniversary of Operation Overlord, I pledge to only get my news from MSNBC, Snapchat, Instagra… ",
    "June 6, 1944, an unprecedented military invasion.  It was called Operation Overlord when Allied troops stormed 5 be… ",
    "Just taking a minute to reflect on Operation Overlord.  America’s most successful Antifa operation.  \n\nLet’s never… ",
    "Operation Overlord 2020 has begun. Fight the roots of Facism. Follow the money. Prisons and Policing is extremely l… ",
    "\"You get your ass on the beach. I’ll be there waiting for you and I’ll tell you what to do. There ain’t anything in… ",
    "#OnThisDay 1944 D-Day. Allied forces landed against 50 miles of heavily fortified German defenses in Normandy, Fran… ",
    "76 years ago today Operation Overlord took place. D-Day. ",
    "The anniversary of Operation Overlord (D-Day) is a good time to look back at the pre-Civil Rights era. \"We cannot f… ",
    "@Koopa_007 Them against the British navy which would have tilted the balance of naval power away from the British t… ",
    "76 years later &amp; we need another #DDay! In 1944 Operation Overlord began with 160,000 soldiers storming the beaches… ",
    "Today marks the 76th anniversary of the Allied landings at Normandy - known as Operation Overlord by military comma… ",
    "82nd Airborne Division\n\nalong with the 101st, they were the first to land in Normandy on June 6, 1944 for Operation… ",
    "The OSS Society is honored to present \"Operation Overlord: OSS and the Battle for France.\" It includes FDR's #DDAY… ",
    "June 6, 1944: Today on this 76th Anniversary we remember all those who took part in Operation Overlord. 156,000 Ame… ",
    "The Normandy Invasion (D-Day), codenamed Operation Overlord, began on June 6, 1944. Over 156,000 troops landed on f… ",
    "@USAS_WW1 @Tank_Archives @TravelBugsWorld @DanielBrasilia @KaraDiDomizio @BattlefieldNDY @Normandythennow @ww2db… ",
    "D-Day Photos And Stories That Capture The Gravity Of The Normandy Invasion  via @ATInteresting#dday",
    "On June 6, 1944, Supreme Allied Commander General Dwight D. Eisenhower gives the go-ahead for the largest amphibiou… ",
    "Waiting for Trump to see Operation Overlord trending and have a revelation about what to name his next usurpation o… ",
    "Today is the 76th anniversary of D Day.\n\nIn 1944, Operation Overlord began as well as the liberation of Nazi-occupi… "
  ]
}