{
  "name": "#DDay",
  "url": "http://twitter.com/search?q=%23DDay",
  "promoted_content": null,
  "query": "%23DDay",
  "tweet_volume": 123177,
  "tweets": [
    "Real antifascists did this, 76 years ago.\n\nFake antifascists desecrated the Churchill statue in London, today.… ",
    "Today, on the 76th Anniversary of #DDay, we remember those who paid the ultimate sacrifice &amp; we honor those who cou… ",
    "\"Full victory -- nothing else.\"  -Gen. Dwight D. Eisenhower\n\nTomorrow we honor the story of the greatest generation… ",
    "@IvankaTrump #DDay  in DC - TODAY\nStart Packing,Barbie ",
    "As we sit in appreciation and remembrance of the sacrifices of our #GreatestGeneration reflecting on #DDay, we must… ",
    "May we never forget the sacrifices made on the beaches at Normandy seventy-six years ago today.  I’m forever gratef… ",
    "Today is the 76th anniversary of #DDay when we fought genocidal racist fascist, I’m sure maga will find it very offensive",
    "Thankful I got the opportunity to visit these historic places. #DDay #WW2 #RLTW ",
    "Today, we pause to remember the bravery and sacrifice of the Greatest Generation. Our World War II Memorial will al… ",
    "@IvankaTrump You need to stop with patriotic tweets, princess. We know you had to go to Wikipedia to find out what #DDay is.",
    "#BlackLivesMattters and #DDay is trending, 2 totally different eras , But still the same racial Tension. It’s sad t… ",
    "Wind of change #WWII #DDay",
    "@AdamBlickstein @Steven_Strauss #DDay with thanks",
    "\"They fight not for the lust of conquest. They fight to end conquest. They fight to liberate.\" \n-- President Frankl… ",
    "Brave boys stormed hostile beaches and parachuted behind enemy lines to fight fascism 76 years ago today. #DDay ",
    "99p eBook editions: The Devil's Own Luck – Pegasus Bridge to the Baltic 1944-45 by Denis Edwards… ",
    "That's what I'm talking about! Greatest generation #DDay ",
    "\"At the core, the American soldiers knew the difference between right and wrong, and they didn't want to live in a… ",
    "Today marks the 76th Anniversary of #DDay. In the first 24 hours of the Normandy invasion, 1465 U.S. troops were ki… ",
    "Thank you for sharing because D-Day still is, if not the most important day for our nation and our allies.  #DDay… ",
    "Let us never forget D-Day. \n\nA big salute to the soldiers who risked their lives on this historic day. \n\n#DDay… ",
    "@senrobportman We are grateful to them, and we should learn from their brave example. Senator, the leader of your p… ",
    "@MrAndyNgo Not 2belittle DallasPD but horses should NEVER be used in riot environs. They are sentient beings easily… ",
    "One of my favourite memorials is the stunning sculpture rising out of the sands on Omaha beach, titled 'Les Braves'… "
  ]
}