{
  "name": "Leverkusen",
  "url": "http://twitter.com/search?q=Leverkusen",
  "promoted_content": null,
  "query": "Leverkusen",
  "tweet_volume": 34837,
  "tweets": [
    "Bayern Munich players are wearing Black Lives Matter armbands during their game vs. Leverkusen. ",
    "Bayern Munich wear shirts in support of Black Lives Matter before their Bundesliga match vs. Leverkusen ",
    "17-year-old Leverkusen midfielder Florian Wirtz is now the youngest Bundesliga goalscorer in history.\n\nThe previous… ",
    "Leverkusen teenager Florian Wirtz's strike late on made him the Bundesliga's youngest-ever scorer, but it was not e… ",
    "Thomas Muller, has flourished well in Dieter Flick's fluid environmen-20 assists (best in Europe), with RB's Emil F… ",
    "German Bundesliga: Bayern Munich comes from behind to win 4 - 2 at Bayern Leverkusen, Champions now two wins away f… ",
    "@Bigwinodds It's not new that you remain the best when it's comes to fixed games. @Bigwinodds thank you for this ga… ",
    "@simcapz1 Ive seen better defending on a sunday than leverkusen though 🤯",
    "Attack and Dethrone God D-Day Kameko Winston Churchill lewandowski Omaha Beach Kameko Calvin Bassey Barron Trump Lo… ",
    "T-shirt No justice No peace by Achraf #Hakimi\n➡➡ \n\n#b04fcb #SGEM05 #BlackLivesMattters… https://t.co/8oRiwRCapR",
    "Leverkusen succumbed to a 2-0 loss after an own goal from Michael Ballack and Markus Oberleitner’s third goal of th… ",
    "Leverkusen wunderkind Wirtz makes history in Bundesliga defeat to Bayern as players mark match with 'Black Lives Ma… ",
    "Bayern don 'Black Lives Matter' shirts, armbands ",
    "Nigeria trends 🇳🇬 follow @seefinish for insight (Bottom 10)\nGaddafi\nSharon\nAre You Ready To Get Married\nTransport 3… ",
    "Manchester United's interest in Bayer Leverkusen's Kai Havertz is \"concrete\". (@cfbayern)\n\n#MUFC #B04",
    "Leverkusen teenager Florian Wirtz's strike late on made him the Bundesliga's youngest-ever scorer, but it was not e… ",
    "Robert Lewandowski took his tally to 30 goals in #Bundesliga this season!\n\n#BayernMunich\n",
    "Leverkusen led the Bundesliga by three points going into the final game of the season and went away to mid table si… ",
    "FC Bayern Munich came from a goal down to overcome Bayer Leverkusen 4-2 in a thrilling game at the BayArena on Satu… ",
    "Bayer Leverkusen wonderkid Florian Wirtz becomes youngest scorer in Bundesliga history as players mark matches with… ",
    "German Championship: Bayern Close To Title With Exciting Victory Over Leverkusen ",
    "As Leverkusen went head-to-head with Bayern Munich earlier this afternoon, we reflect on events 20 years earlier wh… ",
    "@swarnimagrawal Bayer Leverkusen scored against Bayern in the opening 10 mins",
    "Yerp!\n\nHe’s been consistently good since making the move over to Leverkusen. "
  ]
}