{
  "name": "Allied",
  "url": "http://twitter.com/search?q=Allied",
  "promoted_content": null,
  "query": "Allied",
  "tweet_volume": 63829,
  "tweets": [
    "On June 6, 1944, more than 130,000 American and Allied troops stormed the beaches of Normandy to liberate Europe. T… ",
    "Robert Capa landed on Omaha Beach 76 years ago, today. He was the only civilian photographer who risked his life to… ",
    "Today is #DDay.  A day to honor our heroes. \n\nMore than 160,000 brave Allied troops landed along a 50-mile stretch… ",
    "@Sid_Seixeiro My grandfather in Ukraine had been captured by the Germans. The Allied victory led to his release, an… ",
    "On the anniversary of D-Day, I am thinking about the sacrifice of allied forces 76 years ago and the the importance… ",
    "French health ban keeps Allied D-day veterans away  https://t.co/rc52xdZWTy",
    "maybe when they’re not allied with the government 🙃 ",
    "@SBarlow_ROB “Daniel Hannan, Conservative Member of the European Parliament, recalls Supreme Commander of allied fo… ",
    "76 years ago today, thousands of Allied soldiers stormed the beaches of Normandy. D-Day began the liberation of Eur… ",
    "Today, we remember the courage &amp; honour of those who fought in the June 6, 1944 Allied invasion of Normandy, France… ",
    "Want to land a job like \"Security Officer - Healthcare System\" at Allied Universal? Applicant tracking systems look… ",
    "@GoodmenJohnny @BunnyCupcakes31 @CorrosiveRabbit @ChrisAnnett_ @NorbertElekes I hesitate to call Americans cowards.… ",
    "June 6, 1944, an unprecedented military invasion.  It was called Operation Overlord when Allied troops stormed 5 be… ",
    "Today on the 76th anniversary of D-Day, we honor the sacrifice and service of Allied forces in Europe that led to v… ",
    "OPEC, allied nations extend nearly 10M barrel cut by a month ",
    "Still in awe 12 years after being able to visit Normandy of the scale and sacrifice of the allied invasion.\n#DDay76 ",
    "@chickdickloverr @Lewistacey @mark_melbin @Timcast The party switch never happened. Biden has been proven to lie ab… ",
    "#OPEC, allied #nations extend nearly 10M #barrel cut by a month ",
    "76 years ago today was one of the biggest day in history, the brave soldiers from all of the allied forces hit the… ",
    "So yeah im right.Germany aided us with rifles in the boer war.We allied with the pig nation Britain and fought the… ",
    "On this #DDay76, we honor the incredible service &amp; sacrifice of the Allied Forces who took part in the world’s grea… ",
    "Today is the 76th anniversary of D-Day, the allied invasion of Normandy. As protesters are in the street, 76 years… ",
    "Selective Justice at its finest. Only those with power or allied with Duterte is safe from this bill.… ",
    "French health ban keeps Allied D-day veterans away  https://t.co/C9ecIVUm4j"
  ]
}